{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v3.21.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of6.bin", "group1-shard2of6.bin", "group1-shard3of6.bin", "group1-shard4of6.bin", "group1-shard5of6.bin", "group1-shard6of6.bin"], "weights": [{"name": "embedding/embedding/embeddings", "shape": [65, 512], "dtype": "float32"}, {"name": "lips_embedding_dense_1/kernel", "shape": [80, 384], "dtype": "float32"}, {"name": "lips_embedding_dense_2/kernel", "shape": [384, 384], "dtype": "float32"}, {"name": "embedding/lips_embedding/lips_embedding_empty_embedding", "shape": [384], "dtype": "float32"}, {"name": "left_hand_embedding_dense_1/kernel", "shape": [42, 384], "dtype": "float32"}, {"name": "left_hand_embedding_dense_2/kernel", "shape": [384, 384], "dtype": "float32"}, {"name": "embedding/left_hand_embedding/left_hand_embedding_empty_embedding", "shape": [384], "dtype": "float32"}, {"name": "pose_embedding_dense_1/kernel", "shape": [10, 384], "dtype": "float32"}, {"name": "pose_embedding_dense_2/kernel", "shape": [384, 384], "dtype": "float32"}, {"name": "embedding/pose_embedding/pose_embedding_empty_embedding", "shape": [384], "dtype": "float32"}, {"name": "fully_connected_1/kernel", "shape": [384, 512], "dtype": "float32"}, {"name": "fully_connected_2/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "embedding/landmark_weights", "shape": [3], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_1/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_1/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_2/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_2/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_3/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_3/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_4/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_4/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_5/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_5/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_6/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_6/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_7/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_7/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_8/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_8/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_9/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_9/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_10/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_10/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_11/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_11/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_12/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_12/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_13/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_13/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_14/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_14/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_15/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_15/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_16/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_16/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_17/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_17/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_18/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_18/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_19/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_19/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_20/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_20/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_21/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_21/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_22/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_22/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_23/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_23/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_24/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "transformer/multi_head_attention/dense_24/bias", "shape": [512], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_27/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_27/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_28/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_28/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_29/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_29/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_30/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_30/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_31/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_31/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_32/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_32/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_33/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_33/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_34/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_34/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_35/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_35/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_36/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_36/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_37/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_37/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_38/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_38/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_39/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_39/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_40/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_40/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_41/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_41/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_42/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_42/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_43/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_43/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_44/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_44/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_45/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_45/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_46/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_46/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_47/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_47/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_48/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_48/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_49/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_49/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_50/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_50/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_51/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "transformer/multi_head_attention_1/dense_51/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_25/kernel", "shape": [512, 1024], "dtype": "float32"}, {"name": "dense_25/bias", "shape": [1024], "dtype": "float32"}, {"name": "dense_26/kernel", "shape": [1024, 512], "dtype": "float32"}, {"name": "dense_26/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_52/kernel", "shape": [512, 1024], "dtype": "float32"}, {"name": "dense_52/bias", "shape": [1024], "dtype": "float32"}, {"name": "dense_53/kernel", "shape": [1024, 512], "dtype": "float32"}, {"name": "dense_53/bias", "shape": [512], "dtype": "float32"}, {"name": "dense/kernel", "shape": [512, 250], "dtype": "float32"}, {"name": "dense/bias", "shape": [250], "dtype": "float32"}]}]}